app/Controllers/AccountController.php

    public function index() {
        if ($r = $this->requireLogin()) return $r;
        $model = new StudentModel();
        $data['student'] = $model->find(session()->get('student_id'));
---
SELECT *
FROM `students`
WHERE `students`.`id` = '1'