app/Controllers/AnnouncementController.php

    public function index() {
        if ($r = $this->requireLogin()) return $r;

        $model = new AnnouncementModel();

        $announcements = $model->orderBy('created_at', 'DESC')
                               ->paginate(5, 'default');

        $pager       = $model->pager;
        $total       = $model->countAll();
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `announcements`
SELECT COUNT(*) AS `numrows` FROM `announcements`