app/Controllers/AuthController.php

    public function loginPost() {
        // CSRF is auto-handled by CI4
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password'); // use password_hash in production

        // XSS clean (Week 11)
        $username = esc($username);

        $model = new StudentModel();
        $student = $model->where('username', $username)->first();
---
SELECT *
FROM `students`
WHERE `username` = 'Elle@school.edu'
 LIMIT 1