app/Controllers/CourseController.php

SELECT *
FROM `courses`
WHERE `id` NOT IN ('1','2','3','4','5')
---
    public function index() {
        if ($r = $this->requireLogin()) return $r;
        $studentId = session()->get('student_id');
        $model = new CourseModel();

        $enrolled    = $model->getEnrolledCourses($studentId);
        $enrolledIds = array_column($enrolled, 'id');

        if (!empty($enrolledIds)) {
            $available = $model->whereNotIn('id', $enrolledIds)->findAll();