app/Controllers/DashboardController.php

    public function index() {
        if ($r = $this->requireLogin()) return $r;
        $studentId = session()->get('student_id');
        $courseModel = new CourseModel();
        $examModel = new ExamModel();
        $homeworkModel = new HomeworkModel();
        $announcementModel = new AnnouncementModel();

        $data = [
            'courses'       => $courseModel->getEnrolledCourses($studentId),
            'exams'         => $examModel->getExamsByStudent($studentId),
            'homeworks'     => $homeworkModel->getHomeworksByStudent($studentId),
            'announcements' => $announcementModel->orderBy('created_at','DESC')->findAll(5),
---
SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
 LIMIT 5