app/Controllers/HomeworkController.php

    public function index($page = 1) {
        if ($r = $this->requireLogin()) return $r;
        $studentId = session()->get('student_id');
        $model = new HomeworkModel();

        $perPage = 5;
        $total = $model->where('student_id', $studentId)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `homeworks`
WHERE `student_id` = '1'