app/Controllers/PaymentController.php

    public function index() {
        if ($r = $this->requireLogin()) return $r;
        $studentId = session()->get('student_id');

        $paymentModel = new PaymentModel();
        $studentModel = new StudentModel();

        $student  = $studentModel->find($studentId);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '1'