app/Models/CourseModel.php

    public function getEnrolledCourses($studentId) {
        return $this->db->table('courses c')
            ->join('enrollments e', 'e.course_id = c.id')
            ->where('e.student_id', $studentId)
            ->get()->getResultArray();
---
SELECT *
FROM `courses` `c`
JOIN `enrollments` `e` ON `e`.`course_id` = `c`.`id`
WHERE `e`.`student_id` = '1'