app/Models/ExamModel.php

    public function getExamsByStudent($studentId) {
        return $this->db->table('exams ex')
            ->select('ex.*, c.course_code, c.course_name')
            ->join('courses c', 'c.id = ex.course_id')
            ->join('enrollments e', 'e.course_id = ex.course_id')
            ->where('e.student_id', $studentId)
            ->orderBy('ex.exam_date', 'ASC')
            ->get()->getResultArray();
---
SELECT `ex`.*, `c`.`course_code`, `c`.`course_name`
FROM `exams` `ex`
JOIN `courses` `c` ON `c`.`id` = `ex`.`course_id`
JOIN `enrollments` `e` ON `e`.`course_id` = `ex`.`course_id`
WHERE `e`.`student_id` = '1'
ORDER BY `ex`.`exam_date` ASC