app/Models/HomeworkModel.php

SELECT `h`.*, `c`.`course_code`, `c`.`course_name`, `c`.`color`
FROM `homeworks` `h`
JOIN `courses` `c` ON `c`.`id` = `h`.`course_id`
WHERE `h`.`student_id` = '1'
ORDER BY `h`.`due_date` ASC
---
    public function getHomeworksByStudent($studentId) {
        return $this->db->table('homeworks h')
            ->select('h.*, c.course_code, c.course_name, c.color')
            ->join('courses c', 'c.id = h.course_id')
            ->where('h.student_id', $studentId)
            ->orderBy('h.due_date', 'ASC')
            ->get()->getResultArray();